api.meiyuanbang.com/modules/v2_3_2/controllers/favorite/AddAction.php

    public function run() {
        $tid = $this->requestParam('tid', true);
        $type = $this->requestParam('type', true);
        //画夹id
        $folderid = $this->requestParam('folderid');
        if (!$folderid) {
            $folderid = $this->setFavFolder($this->_uid);
        }
        //判断是否已经收藏
        $model = FavoriteService::findOne(['uid' => $this->_uid, 'tid' => $tid, 'type' => $type]);
        if ($model) {
            $this->controller->renderJson(ReturnCodeEnum::STATUS_OK);
        }
        //添加记录
        $model = new FavoriteService();
        $model->tid = $tid;
        $model->type = $type;
        $model->folderid = $folderid;
        $model->uid = $this->_uid;
        $model->ctime = time();
        $ret = $model->save();
---
INSERT INTO `ci_favorite` (`tid`, `type`, `folderid`, `uid`, `ctime`) VALUES ('240', 7, 0, -1, 1510306254)