api.meiyuanbang.com/service/FavoriteService.php

    static function getFavoriteByUidTid($uid, $tid, $type = 0) {
        return Favorite::findOne(['uid' => $uid, "tid" => $tid, "type" => $type]);
---
SELECT * FROM `ci_favorite` WHERE (`uid`='60504') AND (`tid`='83') AND (`type`=7)