api.meiyuanbang.com/service/LiveSignService.php

SELECT COUNT(*) FROM `myb_live_sign` WHERE `liveid`='95'
---
    public static function getLiveSign($liveId) {
        $redis = Yii::$app->cache;
        $rediskey = "live_sign_" . $liveId;
        if (!$redis->get($rediskey)) {
            return LiveSign::find()->where(['liveid' => $liveId])->count();