api.meiyuanbang.com/service/LiveService.php

SELECT * FROM `myb_adv_resource` WHERE `advid`='72'
---
        $detail['rtmp_url'] = 'rtmp://live.meiyuanbang.com/myb/live' . $tmp2 . '_' . $detail['liveid'] . '?auth_key=' . $detail['end_time'] . '-0-0-' . $k;
        $detail['adv_info'] = [];
        if ($detail['advid']) {
            $adv_info = AdvResource::find()->where(['advid' => $detail['advid']])->asArray()->one();