api.meiyuanbang.com/service/RegionService.php

SELECT `region_name` FROM `myb_region` WHERE `region_id`='3236'
---
    public static function getUserCityInfo($region_id) {
        return Region::find()->select(['region_name'])->where(['region_id' => $region_id])->asArray()->one();